Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.6.112/samd20/edc/ATSAMD20E16.PIC
      <edc:SFRDef ltx:memberofperipheral="EIC" edc:cname="INTENSET" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x4000180C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="EXTINT0" edc:nzwidth="0x1" edc:desc="External Interrupt 0 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT1" edc:nzwidth="0x1" edc:desc="External Interrupt 1 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT2" edc:nzwidth="0x1" edc:desc="External Interrupt 2 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT3" edc:nzwidth="0x1" edc:desc="External Interrupt 3 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT4" edc:nzwidth="0x1" edc:desc="External Interrupt 4 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT5" edc:nzwidth="0x1" edc:desc="External Interrupt 5 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT6" edc:nzwidth="0x1" edc:desc="External Interrupt 6 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT7" edc:nzwidth="0x1" edc:desc="External Interrupt 7 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT8" edc:nzwidth="0x1" edc:desc="External Interrupt 8 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT9" edc:nzwidth="0x1" edc:desc="External Interrupt 9 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT10" edc:nzwidth="0x1" edc:desc="External Interrupt 10 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT11" edc:nzwidth="0x1" edc:desc="External Interrupt 11 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT12" edc:nzwidth="0x1" edc:desc="External Interrupt 12 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT13" edc:nzwidth="0x1" edc:desc="External Interrupt 13 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT14" edc:nzwidth="0x1" edc:desc="External Interrupt 14 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT15" edc:nzwidth="0x1" edc:desc="External Interrupt 15 Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EIC" edc:cname="INTFLAG" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x40001810">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="EXTINT0" edc:nzwidth="0x1" edc:desc="External Interrupt 0"/>
            <edc:SFRFieldDef edc:cname="EXTINT1" edc:nzwidth="0x1" edc:desc="External Interrupt 1"/>
            <edc:SFRFieldDef edc:cname="EXTINT2" edc:nzwidth="0x1" edc:desc="External Interrupt 2"/>
            <edc:SFRFieldDef edc:cname="EXTINT3" edc:nzwidth="0x1" edc:desc="External Interrupt 3"/>
            <edc:SFRFieldDef edc:cname="EXTINT4" edc:nzwidth="0x1" edc:desc="External Interrupt 4"/>
            <edc:SFRFieldDef edc:cname="EXTINT5" edc:nzwidth="0x1" edc:desc="External Interrupt 5"/>
            <edc:SFRFieldDef edc:cname="EXTINT6" edc:nzwidth="0x1" edc:desc="External Interrupt 6"/>
            <edc:SFRFieldDef edc:cname="EXTINT7" edc:nzwidth="0x1" edc:desc="External Interrupt 7"/>
            <edc:SFRFieldDef edc:cname="EXTINT8" edc:nzwidth="0x1" edc:desc="External Interrupt 8"/>
            <edc:SFRFieldDef edc:cname="EXTINT9" edc:nzwidth="0x1" edc:desc="External Interrupt 9"/>
            <edc:SFRFieldDef edc:cname="EXTINT10" edc:nzwidth="0x1" edc:desc="External Interrupt 10"/>
            <edc:SFRFieldDef edc:cname="EXTINT11" edc:nzwidth="0x1" edc:desc="External Interrupt 11"/>
            <edc:SFRFieldDef edc:cname="EXTINT12" edc:nzwidth="0x1" edc:desc="External Interrupt 12"/>
            <edc:SFRFieldDef edc:cname="EXTINT13" edc:nzwidth="0x1" edc:desc="External Interrupt 13"/>
            <edc:SFRFieldDef edc:cname="EXTINT14" edc:nzwidth="0x1" edc:desc="External Interrupt 14"/>
            <edc:SFRFieldDef edc:cname="EXTINT15" edc:nzwidth="0x1" edc:desc="External Interrupt 15"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EIC" edc:cname="WAKEUP" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x40001814">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="WAKEUPEN0" edc:nzwidth="0x1" edc:desc="External Interrupt 0 Wake-up Enable"/>
            <edc:SFRFieldDef edc:cname="WAKEUPEN1" edc:nzwidth="0x1" edc:desc="External Interrupt 1 Wake-up Enable"/>
            <edc:SFRFieldDef edc:cname="WAKEUPEN2" edc:nzwidth="0x1" edc:desc="External Interrupt 2 Wake-up Enable"/>
            <edc:SFRFieldDef edc:cname="WAKEUPEN3" edc:nzwidth="0x1" edc:desc="External Interrupt 3 Wake-up Enable"/>
            <edc:SFRFieldDef edc:cname="WAKEUPEN4" edc:nzwidth="0x1" edc:desc="External Interrupt 4 Wake-up Enable"/>
            <edc:SFRFieldDef edc:cname="WAKEUPEN5" edc:nzwidth="0x1" edc:desc="External Interrupt 5 Wake-up Enable"/>
            <edc:SFRFieldDef edc:cname="WAKEUPEN6" edc:nzwidth="0x1" edc:desc="External Interrupt 6 Wake-up Enable"/>
            <edc:SFRFieldDef edc:cname="WAKEUPEN7" edc:nzwidth="0x1" edc:desc="External Interrupt 7 Wake-up Enable"/>
            <edc:SFRFieldDef edc:cname="WAKEUPEN8" edc:nzwidth="0x1" edc:desc="External Interrupt 8 Wake-up Enable"/>
            <edc:SFRFieldDef edc:cname="WAKEUPEN9" edc:nzwidth="0x1" edc:desc="External Interrupt 9 Wake-up Enable"/>
            <edc:SFRFieldDef edc:cname="WAKEUPEN10" edc:nzwidth="0x1" edc:desc="External Interrupt 10 Wake-up Enable"/>
            <edc:SFRFieldDef edc:cname="WAKEUPEN11" edc:nzwidth="0x1" edc:desc="External Interrupt 11 Wake-up Enable"/>
            <edc:SFRFieldDef edc:cname="WAKEUPEN12" edc:nzwidth="0x1" edc:desc="External Interrupt 12 Wake-up Enable"/>
            <edc:SFRFieldDef edc:cname="WAKEUPEN13" edc:nzwidth="0x1" edc:desc="External Interrupt 13 Wake-up Enable"/>
            <edc:SFRFieldDef edc:cname="WAKEUPEN14" edc:nzwidth="0x1" edc:desc="External Interrupt 14 Wake-up Enable"/>
            <edc:SFRFieldDef edc:cname="WAKEUPEN15" edc:nzwidth="0x1" edc:desc="External Interrupt 15 Wake-up Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
